                                    ASSIGNMENT: PANDAS BASICS

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd

In [6]:
list= ['4','8','15','16','23','42']

In [7]:
series= pd.Series(list)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: object

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
list1= ['MOHIT','ROHIT','MUNNI','POOJA','ROLI','BACCHU','ISSHU','ZEEVA','RONAK','KESHAV']

In [9]:
series1= pd.Series(list1)
print(series1)

0     MOHIT
1     ROHIT
2     MUNNI
3     POOJA
4      ROLI
5    BACCHU
6     ISSHU
7     ZEEVA
8     RONAK
9    KESHAV
dtype: object

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q3. Create a Pandas DataFrame that contains the following data:

In [10]:
"""Name
Alice
Bob
Claire

#Age
25
30
27

Gender
Female
Male
Female

Then, print the DataFrame."""

'Name\nAlice\nBob\nClaire\n\n#Age\n25\n30\n27\n\nGender\nFemale\nMale\nFemale\n\nThen, print the DataFrame.'

In [11]:
#making the list for data
data= [['Alice', 25 , 'female'], ['Bob', 30, 'Male'], ['Claire', 27, 'Female']]

In [12]:
#making a dataframe and defining the columns

dataframe=pd.DataFrame(data, columns=['Name', 'Age' , 'Gender'])
print(dataframe)

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  Female

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas dataframe is a structure or a tebular for showing a structural data in a form of table. It is able to store the data from the various structured query languages like sql and excels. By a dataframe we can exicute the multiple functions and method to our data for its better clarifiaction.The very basic differnce is that; in a Pandas, a Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. There are many differnces of properties among dataframe and series.DataFrame always accept the data,which is only in the form of list.

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

There are many functions that we can use for manipulation of data in pandas Dataframe.some of them are following. Here we are using the previous data frame for explaining such functions:

In [22]:
#For priting the first row from uper

dataframe.head(1)

    Name  Age  Gender
0  Alice   25  female

In [23]:
#for prining the rows from lower side
dataframe.tail(1)

     Name  Age  Gender
2  Claire   27  Female

In [24]:
#for printing the data without header
dataframe.head(None)

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  Female

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series
A Series is a one dimensional array like structure with homogeneous data. The values of the series are mutable means we can change any value in series, but the size of the series is immutable so we can not change the size of the series.

Data Frame
DataFrame is a two-dimensional array with heterogeneous data. A DataFrame size is mutable and data is also mutable so we can change the data and size of DataFrame at any time.

Panel
The panel is a three-dimensional data structure with heterogeneous data. It is very hard to represent the Panel in a graphical representation. But a Panel can be illustrated as a container of a DataFrame. In Panel Data and size are mutable.

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [46]:
series1= pd.Series(['Rahul','mojit', 'Ppau'])

In [47]:
series2= pd.Series([21, 22, 13])

In [48]:
series3=pd.Series(['Data science', 'web dev', 'labour'])

In [49]:
data_list=[series1,series2,series3]

In [52]:
dataframe1= pd.DataFrame(data_list)
print(dataframe1)

              0        1       2
0         Rahul    mojit    Ppau
1            21       22      13
2  Data science  web dev  labour